Revit 2026 API

# TransactionGroup(Document, String) Constructor

---

It constructs a transaction group object

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TransactionGroup(
	Document document,
	string transGroupName
)
```
```vb
Public Sub New (
	document As Document,
	transGroupName As String
)
```
```cpp
public:
TransactionGroup(
	Document^ document,
	String^ transGroupName
)
```
```fsharp
new :
        document : Document *
        transGroupName : string -> TransactionGroup
```

#### Parameters

document Document
     The document for which this transaction group is being used.
transGroupName String
     Name of the group. The name will be used only for a group that is assimilated at the end.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The group does not start until its Start method is called.

#### Reference

TransactionGroup Class

TransactionGroup Overload

Autodesk.Revit.DB Namespace